# How to Use Pandas

In [7]:
import pandas as pd

In [8]:
a = pd.Series([1, 'abc', 4.2])
a

0      1
1    abc
2    4.2
dtype: object

In [12]:
b = pd.DataFrame([[2, 'John', 10.4], 
                  [3, 'Mary', 21.3]], 
                 columns = ['ID', 'Name', 'Value'])
b

   ID  Name  Value
0   2  John   10.4
1   3  Mary   21.3

In [11]:
print(b)

   0     1     2
0  2  John  10.4
1  3  Mary  21.3

In [13]:
type(b)

pandas.core.frame.DataFrame

In [14]:
b['ID']

0    2
1    3
Name: ID, dtype: int64

In [15]:
b['Name']

0    John
1    Mary
Name: Name, dtype: object

In [16]:
b[['ID', 'Name']]

   ID  Name
0   2  John
1   3  Mary

In [24]:
b.iloc[0]

ID          2
Name     John
Value    10.4
Name: 0, dtype: object

In [26]:
c = pd.read_csv('https://raw.githubusercontent.com/sgulyano/wd_workshop/master/python/customer.csv')

In [27]:
c

,customer_id,first_name,last_name,email,address,city,state,zip,balance
0,1,George,Washington,gwashington@usa.gov,3200 Mt Vernon Hwy,Mount Vernon,VA,22121,1000
1,2,John,Adams,jadams@usa.gov,1250 Hancock St,Quincy,MA,2169,500
2,3,Thomas,Jefferson,tjefferson@usa.gov,931 Thomas Jefferson Pkwy,Charlottesville,VA,22902,2500
3,4,James,Madison,jmadison@usa.gov,11350 Constitution Hwy,Orange,VA,22960,9000
4,5,James,Monroe,jmonroe@usa.gov,2050 James Monroe Pkwy,Charlottesville,VA,22902,1756

In [28]:
c['first_name']

0    George
1      John
2    Thomas
3     James
4     James
Name: first_name, dtype: object

In [29]:
c.columns

Index(['customer_id', 'first_name', 'last_name', 'email', 'address', 'city',
       'state', 'zip', 'balance'],
      dtype='object')

In [34]:
c.to_excel('ex3.xlsx')

In [33]:
!conda install -y openpyxl

Collecting package metadata (current_repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.7.12
  latest version: 4.8.0

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /home/sarun/anaconda3/envs/wd

  added / updated specs:
    - openpyxl


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    et_xmlfile-1.0.1           |           py38_0          21 KB
    openpyxl-3.0.2             |             py_0         158 KB
    ------------------------------------------------------------
                                           Total:         179 KB

The following NEW packages will be INSTALLED:

  et_xmlfile         pkgs/main/linux-64::et_xmlfile-1.0.1-py38_0
  jdcal              pkgs/main/noarch::jdcal-1.4.1-py_0
  openpyxl           pkgs/main/noarch::openpyxl-3.0.2-py_0



Downloading and Extracting Packages
openpyxl-3.0.2       | 158 KB    | ##################################### | 100%
et_xmlfile-1.0.1     | 21 KB     | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [38]:
pd.DataFrame(c.values)

,0,1,2,3,4,5,6,7,8
0,1,George,Washington,gwashington@usa.gov,3200 Mt Vernon Hwy,Mount Vernon,VA,22121,1000
1,2,John,Adams,jadams@usa.gov,1250 Hancock St,Quincy,MA,2169,500
2,3,Thomas,Jefferson,tjefferson@usa.gov,931 Thomas Jefferson Pkwy,Charlottesville,VA,22902,2500
3,4,James,Madison,jmadison@usa.gov,11350 Constitution Hwy,Orange,VA,22960,9000
4,5,James,Monroe,jmonroe@usa.gov,2050 James Monroe Pkwy,Charlottesville,VA,22902,1756